/* ----------------------------------------------------------------------------
*   COPYRIGHT(C) 2011 RENESAS TECHNOLOGY CORPORATION
*   AND RENESAS SOLUTIONS CORPORATION ALL RIGHTS RESERVED
*
* [FILE]
*     target.h
*
* [DESCRIPTION]
*     R8C/Tinyｼﾘｰｽﾞ用SFR定義ﾌｧｲﾙ(C言語用)
*
* [NOTE]
*     1. このプログラムは教育用です。(転用不可)
*     2. OAKS8-LCD Board対応
*     3. OAKS8-R5F21114FP(R8C/11グループ,20MHz)対応
*
* [VERSION]
*     v1.00  2011/05/20 RENESAS Semiconductor Training Center  新規作成
* ---------------------------------------------------------------------------*/

#ifndef __TARGET_H
#define __TARGET_H

/******************************************************************************
*  SFR領域の型宣言
******************************************************************************/
struct bit_def {			/* ビットアクセス用			*/
    unsigned char  b0:1;	/* ビット0(LSB)				*/
    unsigned char  b1:1;	/* ビット1					*/
    unsigned char  b2:1;	/* ビット2					*/
    unsigned char  b3:1;	/* ビット3					*/
    unsigned char  b4:1;	/* ビット4					*/
    unsigned char  b5:1;	/* ビット5					*/
    unsigned char  b6:1;	/* ビット6					*/
    unsigned char  b7:1;	/* ビット7(MSB)				*/
};

union byte_def{				/* ビット/バイトアクセス用	*/
  unsigned char  byte;		/* バイトアクセス用			*/
  struct bit_def bit;		/* ビットアクセス用			*/
};


/*-----------------------------------------------------------------------------
 *	プロテクトレジスタ
 *---------------------------------------------------------------------------*/
#define		PRCR_ADDR	(*(volatile union byte_def *)0x000A)
#define		PRCR		PRCR_ADDR.byte

/* プロテクトビット0	*/
#define		PRC0		PRCR_ADDR.bit.b0/* CM0,CM1,OCD,HR0,HR1レジスタへの
																書き込み許可*/
/* プロテクトビット1	*/
#define		PRC1		PRCR_ADDR.bit.b1/* PM0,PM1レジスタへの書き込み許可	*/
/* プロテクトビット2	*/
#define		PRC2		PRCR_ADDR.bit.b2/* PD0レジスタへの書き込み許可		*/

/*-----------------------------------------------------------------------------
 *	INT0入力フィルタ選択レジスタ
 *---------------------------------------------------------------------------*/
#define		INT0F_ADDR	(*(volatile unsigned char *)0x001E)
#define		INT0F		INT0F_ADDR

/*-----------------------------------------------------------------------------
 * タイマX割り込み制御レジスタ
 *---------------------------------------------------------------------------*/
#define		TXIC_ADDR	(*(volatile union byte_def *)0x0056)
#define		TXIC		TXIC_ADDR.byte

/* タイマX割り込み要求ビット	*/
#define		IR_TXIC		 TXIC_ADDR.bit.b3

/*-----------------------------------------------------------------------------
 * タイマY割り込み制御レジスタ
 *---------------------------------------------------------------------------*/
#define		TYIC_ADDR	(*(volatile unsigned char *)0x0057)
#define		TYIC		TYIC_ADDR

/*-----------------------------------------------------------------------------
 * コンペア0割り込み制御レジスタ
 *---------------------------------------------------------------------------*/
#define		CMP0IC_ADDR	(*(volatile union byte_def *)0x005C)
#define		CMP0IC		CMP0IC_ADDR.byte

/* コンペア0割り込み要求ビット	*/
#define		IR_CMP0IC	CMP0IC_ADDR.bit.b3

/*-----------------------------------------------------------------------------
 * INT0割り込み制御レジスタ
 *---------------------------------------------------------------------------*/
#define		INT0IC_ADDR	(*(volatile union byte_def *)0x005D)
#define		INT0IC		INT0IC_ADDR.byte

/* INT0割り込み要求ビット	*/
#define		IR_INT0IC	INT0IC_ADDR.bit.b3

/*-----------------------------------------------------------------------------
 *	タイマY,Zモードレジスタ
 *---------------------------------------------------------------------------*/
#define		TYZMR_ADDR	(*(volatile union byte_def *)0x0080)
#define		TYZMR		TYZMR_ADDR.byte

/* タイマYカウント開始フラグ	*/
#define		TYS			TYZMR_ADDR.bit.b3

/*-----------------------------------------------------------------------------
 *	プリスケーラYレジスタ
 *---------------------------------------------------------------------------*/
#define		PREY_ADDR	(*(volatile unsigned char *)0x0081)
#define		PREY		PREY_ADDR

/*-----------------------------------------------------------------------------
 *	タイマYプライマリレジスタ
 *---------------------------------------------------------------------------*/
#define		TYPR_ADDR	(*(volatile unsigned char *)0x0083)
#define		TYPR		TYPR_ADDR

/*-----------------------------------------------------------------------------
 *	タイマXモードレジスタ
 *---------------------------------------------------------------------------*/
#define		TXMR_ADDR	(*(volatile union byte_def *)0x008B)
#define		TXMR		TXMR_ADDR.byte

/* タイマXカウント開始フラグ	*/
#define		TXS			TXMR_ADDR.bit.b3

/*-----------------------------------------------------------------------------
 *プリスケーラXレジスタ
 *---------------------------------------------------------------------------*/
#define		PREX_ADDR	(*(volatile unsigned char *)0x008C)
#define		PREX		PREX_ADDR

/*-----------------------------------------------------------------------------
 * タイマX
 *---------------------------------------------------------------------------*/
#define		TX_ADDR		(*(volatile unsigned char *)0x008D)
#define		TX			TX_ADDR

/*-----------------------------------------------------------------------------
 * タイマカウントソース選択レジスタ
 *---------------------------------------------------------------------------*/
#define		TCSS_ADDR	(*(volatile union byte_def *)0x008E)
#define		TCSS		TCSS_ADDR

/*-----------------------------------------------------------------------------
 * タイマC
 *---------------------------------------------------------------------------*/
#define		TC_ADDR		(*(volatile unsigned int *)0x0090)
#define		TC			TC_ADDR

/*-----------------------------------------------------------------------------
 *  外部入力許可レジスタ
 *---------------------------------------------------------------------------*/
#define		INTEN_ADDR	(*(volatile union byte_def *)0x0096)
#define		INTEN		INTEN_ADDR.byte

/* INT0入力許可ビット	*/
#define		INT0EN		INTEN_ADDR.bit.b0

/*-----------------------------------------------------------------------------
 * タイマC制御レジスタ0
 *---------------------------------------------------------------------------*/
#define		TCC0_ADDR	(*(volatile union byte_def *)0x009A)
#define		TCC0		TCC0_ADDR.byte

/* タイマCカウント開始ビット	*/
#define		TCC00		TCC0_ADDR.bit.b0

/*-----------------------------------------------------------------------------
 * タイマC制御レジスタ1
 *---------------------------------------------------------------------------*/
#define		TCC1_ADDR	(*(volatile unsigned char  *)0x009B)
#define		TCC1		TCC1_ADDR

/*-----------------------------------------------------------------------------
 * キャプチャ、コンペア0レジスタ
 *---------------------------------------------------------------------------*/
#define		TM0_ADDR	(*(volatile unsigned int *)0x009C)
#define		TM0			TM0_ADDR

/*-----------------------------------------------------------------------------
 * A-Dレジスタ
 *---------------------------------------------------------------------------*/
#define		AD_ADDR		(*(volatile unsigned int *)0x00C0)
#define		AD			AD_ADDR

/*-----------------------------------------------------------------------------
 * A-D制御レジスタ2
 *---------------------------------------------------------------------------*/
#define		ADCON2_ADDR	(*(volatile unsigned char *)0x00D4)
#define		ADCON2		ADCON2_ADDR

/*-----------------------------------------------------------------------------
 * A-D制御レジスタ0
 *---------------------------------------------------------------------------*/
#define		ADCON0_ADDR	(*(volatile union byte_def *)0x00D6)
#define		ADCON0		ADCON0_ADDR.byte

/* A-D変換開始フラグ	*/
#define		ADST		ADCON0_ADDR.bit.b6

/*-----------------------------------------------------------------------------
 * A-D制御レジスタ1
 *---------------------------------------------------------------------------*/
#define		ADCON1_ADDR	(*(volatile unsigned char *)0x00D7)
#define		ADCON1		ADCON1_ADDR

/*-----------------------------------------------------------------------------
 * ポートP0レジスタ
 *---------------------------------------------------------------------------*/
#define		P0_ADDR		(*(volatile union byte_def *)0x00E0)
#define		P0			P0_ADDR.byte

#define		P0_0		P0_ADDR.bit.b0		/* ポートP0のビット0 */
#define		P0_1		P0_ADDR.bit.b1		/* ポートP0のビット1 */
#define		P0_2		P0_ADDR.bit.b2		/* ポートP0のビット2 */
#define		P0_3		P0_ADDR.bit.b3		/* ポートP0のビット3 */
#define		P0_4		P0_ADDR.bit.b4		/* ポートP0のビット4 */
#define		P0_5		P0_ADDR.bit.b5		/* ポートP0のビット5 */
#define		P0_6		P0_ADDR.bit.b6		/* ポートP0のビット6 */
#define		P0_7		P0_ADDR.bit.b7		/* ポートP0のビット7 */

/*-----------------------------------------------------------------------------
 * ポートP1レジスタ
 *---------------------------------------------------------------------------*/
#define		P1_ADDR		(*(volatile union byte_def *)0x00E1)
#define		P1			P1_ADDR.byte

#define		P1_0		P1_ADDR.bit.b0		/* ポートP1のビット0 */
#define		P1_1		P1_ADDR.bit.b1		/* ポートP1のビット1 */
#define		P1_2		P1_ADDR.bit.b2		/* ポートP1のビット2 */
#define		P1_3		P1_ADDR.bit.b3		/* ポートP1のビット3 */
#define		P1_4		P1_ADDR.bit.b4		/* ポートP1のビット4 */
#define		P1_5		P1_ADDR.bit.b5		/* ポートP1のビット5 */
#define		P1_6		P1_ADDR.bit.b6		/* ポートP1のビット6 */
#define		P1_7		P1_ADDR.bit.b7		/* ポートP1のビット7 */

/*-----------------------------------------------------------------------------
 * ポートP0方向レジスタ
 *---------------------------------------------------------------------------*/
#define		PD0_ADDR	(*(volatile union byte_def *)0x00E2)
#define		PD0			PD0_ADDR.byte

#define		PD0_0		PD0_ADDR.bit.b0		/* ポートP0方向レジスタのビット0 */
#define		PD0_1		PD0_ADDR.bit.b1		/* ポートP0方向レジスタのビット1 */
#define		PD0_2		PD0_ADDR.bit.b2		/* ポートP0方向レジスタのビット2 */
#define		PD0_3		PD0_ADDR.bit.b3		/* ポートP0方向レジスタのビット3 */
#define		PD0_4		PD0_ADDR.bit.b4		/* ポートP0方向レジスタのビット4 */
#define		PD0_5		PD0_ADDR.bit.b5		/* ポートP0方向レジスタのビット5 */
#define		PD0_6		PD0_ADDR.bit.b6		/* ポートP0方向レジスタのビット6 */
#define		PD0_7		PD0_ADDR.bit.b7		/* ポートP0方向レジスタのビット7 */

/*-----------------------------------------------------------------------------
 * ポートP1方向レジスタ
 *---------------------------------------------------------------------------*/
#define		PD1_ADDR	(*(volatile union byte_def *)0x00E3)
#define		PD1			PD1_ADDR.byte

#define		PD1_0		PD1_ADDR.bit.b0		/* ポートP1方向レジスタのビット0 */
#define		PD1_1		PD1_ADDR.bit.b1		/* ポートP1方向レジスタのビット1 */
#define		PD1_2		PD1_ADDR.bit.b2		/* ポートP1方向レジスタのビット2 */
#define		PD1_3		PD1_ADDR.bit.b3		/* ポートP1方向レジスタのビット3 */
#define		PD1_4		PD1_ADDR.bit.b4		/* ポートP1方向レジスタのビット4 */
#define		PD1_5		PD1_ADDR.bit.b5		/* ポートP1方向レジスタのビット5 */
#define		PD1_6		PD1_ADDR.bit.b6		/* ポートP1方向レジスタのビット6 */
#define		PD1_7		PD1_ADDR.bit.b7		/* ポートP1方向レジスタのビット7 */

/*-----------------------------------------------------------------------------
 * ポートP3レジスタ
 *---------------------------------------------------------------------------*/
#define		P3_ADDR		(*(volatile union byte_def *)0x00E5)
#define		P3			P3_ADDR.byte

#define		P3_0		P3_ADDR.bit.b0		/* ポートP3のビット0 */
#define		P3_1		P3_ADDR.bit.b1		/* ポートP3のビット1 */
#define		P3_2		P3_ADDR.bit.b2		/* ポートP3のビット2 */
#define		P3_3		P3_ADDR.bit.b3		/* ポートP3のビット3 */
#define		P3_7		P3_ADDR.bit.b7		/* ポートP3のビット7 */

/*-----------------------------------------------------------------------------
 * ポートP3方向レジスタ
 *---------------------------------------------------------------------------*/
#define		PD3_ADDR	(*(volatile union byte_def *)0x00E7)
#define		PD3			PD3_ADDR.byte

#define		PD3_0		PD3_ADDR.bit.b0		/* ポートP3方向レジスタのビット0 */
#define		PD3_1		PD3_ADDR.bit.b1		/* ポートP3方向レジスタのビット1 */
#define		PD3_2		PD3_ADDR.bit.b2		/* ポートP3方向レジスタのビット2 */
#define		PD3_3		PD3_ADDR.bit.b3		/* ポートP3方向レジスタのビット3 */
#define		PD3_7		PD3_ADDR.bit.b7		/* ポートP3方向レジスタのビット7 */

/*-----------------------------------------------------------------------------
 * ポートP4レジスタ
 *---------------------------------------------------------------------------*/
#define		P4_ADDR		(*(volatile union byte_def *)0x00E8)
#define		P4			P4_ADDR.byte

#define		P4_5		P4_ADDR.bit.b5		/* ポートP4のビット5 */
#define		P4_6		P4_ADDR.bit.b6		/* ポートP4のビット6 */
#define		P4_7		P4_ADDR.bit.b7		/* ポートP4のビット7 */

/*-----------------------------------------------------------------------------
 * ポートP4方向レジスタ
 *---------------------------------------------------------------------------*/
#define		PD4_ADDR	(*(volatile union byte_def *)0x00EA)
#define		PD4			PD4_ADDR.byte

#define		PD4_5		PD4_ADDR.bit.b5		/* ポートP4方向レジスタのビット5 */

/*-----------------------------------------------------------------------------
 * プルアップ制御レジスタ0
 *---------------------------------------------------------------------------*/
#define		PUR0_ADDR	(*(volatile union byte_def *)0x00FC)
#define		PUR0		PUR0_ADDR.byte

/* ポートP0ビット4からビット7のプルアップ	*/
/* (入力モードの端子に対して有効)			*/
#define    PU01    PUR0_ADDR.bit.b1
/* ポートP3ビット0からビット3のプルアップ	*/
/* (入力モードの端子に対して有効)			*/
#define    PU06    PUR0_ADDR.bit.b6

/*-----------------------------------------------------------------------------
 * プルアップ制御レジスタ1
 *---------------------------------------------------------------------------*/
#define		PUR1_ADDR	(*(volatile union byte_def *)0x00FD)
#define		PUR1		PUR1_ADDR.byte

/* ポートP5ビット5のプルアップ				*/
/* (入力モードの端子に対して有効)			*/
#define    PU11    PUR1_ADDR.bit.b1 


#endif /*__TARGET_H*/

/******************************************************************************
    end of file
******************************************************************************/
